// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "اذا كانت د(س)= 3س(س + 3) كثيره الحدود من الدرجه ...........",
  answer: "الثانيه",
  options: [
    "الاولي",
    "الثانيه",
    "الثالثه",
    "الرابعه"
  ]
},
  {
  numb: 2,
  question: "اذا كان  معادلتي الخطان المستقيمان : س+ص = 5 , ك س + 2ص = 0 متوازيان ، فان قيمه ك تساوي .....",
  answer: "2" ,
  options: [
    "2",
    "-2",
    "1",
    "-1"
  ]
},
  {
  numb: 3,
  question: "الداله ص = 5س + 1 هي داله خطيه ؟",
  answer: "صواب",
  options: [
    "خطا",
    "صواب",
    
    
  ]
},
  {
  numb: 4,
  question: "عند تمثيل الداله المعرفه بالقاعده د(س) =  -10س بيانيا فان الخط المستقيم .......... ",
  answer: "يمر بنقطه الاصل",
  options: [
    "يوازي محور السينات",
    "يوازي محور الصادات",
    "يمر بنقطه الاصل",
    "عموديا علي السينات"
  ]
},
  {
  numb: 5,
  question: "منحني الداله التربيعيه يكون له قيمه صغري اذا كانت اشاره معامل س تربيع = ...........",
  answer: "موجبه",
  options: [
    "موجبه",
    "تساوي صفر",
    "سالبه",
  ]
},


  {
  numb: 6,
  question: "ذا كانت (3 , ص ) تنتمي الي منحني الداله د:د(س)= 3س( س(تربيع) + 2س  + 1) فان ص = ..........",
  answer: " 16" ,
  options: [
    "9",
    " 2",
    " 15",
    " 16"
  ]
},
];