// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "من أكثر النظريات قبولاً بين العلماء والتي فسرت نشأة الكون ......",
    answer:  "نظرية الانفجار العظيم",
    options: [
      "نظرية السديم",
      "نظرية الانفجار العظيم",
      "نظرية النجم العابر ",
      "لنظرية الحديثة"
    ]
  },
    {
    numb: 2,
    question: "تستغرق الشمس حوالي ...... مليون سنة لتكمل دورة واحدة حول مركز المجرة",
    answer: "220" ,
    options: [
      "220",
      "320",
      "120",
      "230",
    ]
  },
    {
    numb: 3,
    question:  "وحدة قياس المسافات بين النجوم والمجرات في الفضاء هي ..........",
    answer: "",
    options: [
      "السنة الضوئية",
      "الكيلو متر",
      "الميل",
      "الهكتار",
      
    ]
  },
    {
    numb: 4,
    question: "عند تمثيل الداله المعرفه بالقاعده د(س) =  -10س بيانيا فان الخط المستقيم .......... ",
    answer: "يمر بنقطه الاصل",
    options: [
      "يوازي محور السينات",
      "يوازي محور الصادات",
      "يمر بنقطه الاصل",
      "عموديا علي السينات"
    ]
  },
    {
    numb: 5,
    question: "الغازان اللذان أنتجا المجرات والنجوم عبر ملايين السنين هما ...........",
    answer: "الهيدروجين والهيليوم",
    options: [
      "الهيدروجين والهيليوم",
      "الهيدروجين والأكسجين",
      " الهيليوم والأكسجين",
      " الاكسيجين والأكسجين",
    ]
  },


    {
    numb: 6,
    question: "يستخدم الفلكيون معدات خاصة بدراسة الشمس هي ....... ",
    answer: " 16" ,
    options: [
      "المرايا",
      " التلسكوبات",
      " العدسات",
      " النظارات"
    ]
  },
];